In [1]:
import pandas as pd

In [2]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\fathima\anaconda3\lib\site-packages (3.0.5)
Requirement already satisfied: et-xmlfile in c:\users\fathima\anaconda3\lib\site-packages (from openpyxl) (1.0.1)
Requirement already satisfied: jdcal in c:\users\fathima\anaconda3\lib\site-packages (from openpyxl) (1.4.1)

In [3]:
df = pd.read_excel(r'C:\Users\FATHIMA\Desktop\Datasceience_NareshIT\Feb\15th,17th - Kaggle, Dt , time split\TASK\TASK.xlsx')

In [4]:
df

                                          ADDR         DT NAME     time
0  45 rd, kenith street, btm, bangalore 500038 2022-04-03  abc  8:30:21
1            45 rd,  street, hitech, Hd 500038 2022-04-02  dec  5:30:21

In [5]:
df['ADDR'] = df['ADDR'].str.replace(r'\s*,\s*', ', ', regex=True).str.strip()
df['ADDR']

0    45 rd, kenith street, btm, bangalore 500038
1               45 rd, street, hitech, Hd 500038
Name: ADDR, dtype: object

In [6]:
df[['Street', 'Area','Region', 'CityZip']] = df['ADDR'].str.split(', ', n=3, expand=True)
df

,ADDR,DT,NAME,time,Street,Area,Region,CityZip
0,"45 rd, kenith street, btm, bangalore 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore 500038
1,"45 rd, street, hitech, Hd 500038",2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd 500038

In [7]:
df[['City', 'Zip_Code']] = df['CityZip'].str.rsplit(' ', n=1, expand=True)
df

,ADDR,DT,NAME,time,Street,Area,Region,CityZip,City,Zip_Code
0,"45 rd, kenith street, btm, bangalore 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore 500038,bangalore,500038
1,"45 rd, street, hitech, Hd 500038",2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd 500038,Hd,500038

In [8]:
df.drop(['ADDR', 'CityZip'], axis=1, inplace=True)
df

          DT NAME     time Street           Area  Region       City Zip_Code
0 2022-04-03  abc  8:30:21  45 rd  kenith street     btm  bangalore   500038
1 2022-04-02  dec  5:30:21  45 rd         street  hitech         Hd   500038

In [9]:
df[['Year', 'Month','Date']] = df['DT'].str.split(', ', n=2, expand=True)
df

AttributeError: Can only use .str accessor with string values!

In [10]:
df['DT'] = pd.to_datetime(df['DT'], dayfirst=True)
df

          DT NAME     time Street           Area  Region       City Zip_Code
0 2022-04-03  abc  8:30:21  45 rd  kenith street     btm  bangalore   500038
1 2022-04-02  dec  5:30:21  45 rd         street  hitech         Hd   500038

In [11]:
df[['Hrs', 'Minutes', 'Seconds']] = df['time'].str.split(':', expand=True)
df

,DT,NAME,time,Street,Area,Region,City,Zip_Code,Hrs,Minutes,Seconds
0,2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore,500038,8,30,21
1,2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd,500038,5,30,21

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   DT        2 non-null      datetime64[ns]
 1   NAME      2 non-null      object
 2   time      2 non-null      object
 3   Street    2 non-null      object
 4   Area      2 non-null      object
 5   Region    2 non-null      object
 6   City      2 non-null      object
 7   Zip_Code  2 non-null      object
 8   Hrs       2 non-null      object
 9   Minutes   2 non-null      object
 10  Seconds   2 non-null      object
dtypes: datetime64[ns](1), object(10)
memory usage: 304.0+ bytes

In [13]:
df[['Hrs', 'Minutes', 'Seconds']] = df[['Hrs', 'Minutes', 'Seconds']].astype(int)
df[['Zip_Code']] = df[['Zip_Code']].astype(int)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   DT        2 non-null      datetime64[ns]
 1   NAME      2 non-null      object
 2   time      2 non-null      object
 3   Street    2 non-null      object
 4   Area      2 non-null      object
 5   Region    2 non-null      object
 6   City      2 non-null      object
 7   Zip_Code  2 non-null      int32
 8   Hrs       2 non-null      int32
 9   Minutes   2 non-null      int32
 10  Seconds   2 non-null      int32
dtypes: datetime64[ns](1), int32(4), object(6)
memory usage: 272.0+ bytes

In [15]:
df.drop("time", axis = 1, inplace = True)
df

,DT,NAME,Street,Area,Region,City,Zip_Code,Hrs,Minutes,Seconds
0,2022-04-03,abc,45 rd,kenith street,btm,bangalore,500038,8,30,21
1,2022-04-02,dec,45 rd,street,hitech,Hd,500038,5,30,21

In [16]:
date_new = pd.DataFrame({
    'Year': df['DT'].dt.year,
    'Month': df['DT'].dt.month,
    'Day': df['DT'].dt.day,
})
date_new

   Year  Month  Day
0  2022      4    3
1  2022      4    2

In [17]:
df[['Year', 'Month', 'Date']] = date_new
df

,DT,NAME,Street,Area,Region,City,Zip_Code,Hrs,Minutes,Seconds,Year,Month,Date
0,2022-04-03,abc,45 rd,kenith street,btm,bangalore,500038,8,30,21,2022,4,3
1,2022-04-02,dec,45 rd,street,hitech,Hd,500038,5,30,21,2022,4,2

In [18]:
df.drop("DT", axis = 1, inplace = True)
df

,NAME,Street,Area,Region,City,Zip_Code,Hrs,Minutes,Seconds,Year,Month,Date
0,abc,45 rd,kenith street,btm,bangalore,500038,8,30,21,2022,4,3
1,dec,45 rd,street,hitech,Hd,500038,5,30,21,2022,4,2